<details ><summary>apply for talos-bootstrap 2025-07-20 01:10:44 (UTC)</summary>
    <details ><summary>Locking successful</summary>
  Project vaughnw128/immanent-grove#talos-bootstrap has been locked by PR #74
</details>

<details ><summary>Apply output</summary>

```terraform
Terraform will perform the following actions:

  # proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"] must be replaced
-/+ resource "proxmox_virtual_environment_download_file" "talos_nocloud_image" {
      ~ id                      = "local:iso/talos-nocloud-amd64.img" -> (known after apply)
      ~ size                    = 1306525696 -> (known after apply)
      ~ url                     = "https://factory.talos.dev/image/58e4656b31857557c8bad0585e1b2ee53f7446f4218f3fae486aa26d4f6470d8/v1.9.2/nocloud-amd64.raw.zst" -> "https://factory.talos.dev/image/84f66f3fa52900a0234636ae1da07d5b356cce774673951af35866142158fce6/v1.10.5/nocloud-amd64.raw.zst" # forces replacement
        # (9 unchanged attributes hidden)
    }

  # proxmox_virtual_environment_vm.talos_vm["controlplane-1"] must be replaced
-/+ resource "proxmox_virtual_environment_vm" "talos_vm" {
      ~ id                      = "102" -> (known after apply)
      ~ ipv4_addresses          = [
          - [
              - "127.0.0.1",
              - "169.254.116.108",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "10.0.0.50",
            ],
          - [],
          - [
              - "10.244.1.143",
            ],
          - [],
          - [],
        ] -> (known after apply)
      ~ ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "fe80::be24:11ff:fea4:9e89",
            ],
          - [
              - "fe80::ee:ffff:fe94:dd60",
            ],
          - [
              - "fe80::dc6d:ccff:fe83:b436",
            ],
          - [
              - "fe80::dcbb:40ff:fe5c:52ca",
            ],
          - [
              - "fe80::a43f:dfff:fef2:413",
            ],
        ] -> (known after apply)
      ~ mac_addresses           = [
          - "00:00:00:00:00:00",
          - "72:94:51:BD:16:A7",
          - "AE:F9:54:54:66:05",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "BC:24:11:A4:9E:89",
          - "02:EE:FF:94:DD:60",
          - "DE:6D:CC:83:B4:36",
          - "DE:BB:40:5C:52:CA",
          - "A6:3F:DF:F2:04:13",
        ] -> (known after apply)
        name                    = "talos-controlplane-1"
      ~ network_interface_names = [
          - "lo",
          - "bond0",
          - "dummy0",
          - "teql0",
          - "tunl0",
          - "sit0",
          - "ip6tnl0",
          - "eth0",
          - "cilium_net",
          - "cilium_host",
          - "cilium_vxlan",
          - "lxc_health",
        ] -> (known after apply)
      ~ tags                    = [
          - "talos",
            "terraform",
          + "talos",
        ]
      ~ vm_id                   = 102 -> (known after apply)
        # (25 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
            # (9 unchanged attributes hidden)
        }

      ~ disk {
          ~ file_id           = "local:iso/talos-nocloud-amd64.img" # forces replacement -> (known after apply) # forces replacement
          ~ path_in_datastore = "vm-102-disk-0" -> (known after apply)
            # (12 unchanged attributes hidden)
        }

      ~ initialization {
          - interface            = "ide2" -> null
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:A4:9E:89" -> (known after apply)
            # (9 unchanged attributes hidden)
        }

      ~ vga {
          + acpi                    = (known after apply)
          + bios                    = (known after apply)
          + boot_order              = (known after apply)
          + description             = (known after apply)
          + hook_script_file_id     = (known after apply)
          + id                      = (known after apply)
          + ipv4_addresses          = (known after apply)
          + ipv6_addresses          = (known after apply)
          + keyboard_layout         = (known after apply)
          + kvm_arguments           = (known after apply)
          + mac_addresses           = (known after apply)
          + machine                 = (known after apply)
          + migrate                 = (known after apply)
          + name                    = (known after apply)
          + network_interface_names = (known after apply)
          + node_name               = (known after apply)
          + on_boot                 = (known after apply)
          + pool_id                 = (known after apply)
          + protection              = (known after apply)
          + reboot                  = (known after apply)
          + reboot_after_update     = (known after apply)
          + scsi_hardware           = (known after apply)
          + started                 = (known after apply)
          + stop_on_destroy         = (known after apply)
          + tablet_device           = (known after apply)
          + tags                    = (known after apply)
          + template                = (known after apply)
          + timeout_clone           = (known after apply)
          + timeout_create          = (known after apply)
          + timeout_migrate         = (known after apply)
          + timeout_move_disk       = (known after apply)
          + timeout_reboot          = (known after apply)
          + timeout_shutdown_vm     = (known after apply)
          + timeout_start_vm        = (known after apply)
          + timeout_stop_vm         = (known after apply)
          + vm_id                   = (known after apply)
        } -> (known after apply)

        # (3 unchanged blocks hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.
proxmox_virtual_environment_vm.talos_vm["controlplane-1"]: Destroying... [id=102]
proxmox_virtual_environment_vm.talos_vm["controlplane-1"]: Still destroying... [id=102, 10s elapsed]
proxmox_virtual_environment_vm.talos_vm["controlplane-1"]: Still destroying... [id=102, 20s elapsed]
proxmox_virtual_environment_vm.talos_vm["controlplane-1"]: Still destroying... [id=102, 30s elapsed]
proxmox_virtual_environment_vm.talos_vm["controlplane-1"]: Still destroying... [id=102, 40s elapsed]
proxmox_virtual_environment_vm.talos_vm["controlplane-1"]: Still destroying... [id=102, 50s elapsed]
proxmox_virtual_environment_vm.talos_vm["controlplane-1"]: Still destroying... [id=102, 1m0s elapsed]
proxmox_virtual_environment_vm.talos_vm["controlplane-1"]: Destruction complete after 1m2s
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Destroying... [id=local:iso/talos-nocloud-amd64.img]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Destruction complete after 0s
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Creating...
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [10s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [20s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [30s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [40s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [50s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [1m0s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [1m10s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [1m20s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [1m30s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [1m40s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [1m50s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [2m0s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [2m10s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [2m20s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [2m30s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [2m40s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [2m50s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [3m0s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [3m10s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [3m20s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [3m30s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [3m40s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [3m50s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [4m0s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [4m10s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [4m20s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [4m30s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [4m40s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [4m50s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [5m0s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [5m10s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [5m20s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [5m30s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [5m40s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [5m50s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [6m0s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [6m10s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [6m20s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [6m30s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [6m40s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [6m50s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [7m0s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [7m10s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [7m20s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [7m30s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [7m40s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [7m50s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [8m0s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Creation complete after 8m7s [id=local:iso/talos-nocloud-amd64.img]
proxmox_virtual_environment_vm.talos_vm["controlplane-1"]: Creating...
proxmox_virtual_environment_vm.talos_vm["controlplane-1"]: Still creating... [10s elapsed]
proxmox_virtual_environment_vm.talos_vm["controlplane-1"]: Creation complete after 20s [id=100]

Apply complete! Resources: 2 added, 0 changed, 2 destroyed.

Outputs:

kubeconfig = <sensitive>

```
</details>

</details>